Repository: zhy65401/goodToNote
Catalog: GoodToNote/Localizable.xcstrings
Source language: en
Languages: zh_hans

# (可选)
source: (optional)
zh_hans: (可选)

# (可选)再填「主题包含 / Subject Contains」进一步收窄,比如只要含「交易 / transaction」的邮件。
source: (Optional) Add “Subject Contains” to narrow further, e.g. only emails containing “transaction”.
zh_hans: (可选)再填「主题包含 / Subject Contains」进一步收窄,比如只要含「交易 / transaction」的邮件。

# (可选)填「主题包含 / Subject Contains」进一步收窄。
source: (Optional) Add “Subject Contains” to narrow it further.
zh_hans: (可选)填「主题包含 / Subject Contains」进一步收窄。

# (可选)把「邮件主题」设为「快捷指令输入」里的名称变量,便于未识别时回看。
source: (Optional) Set “Email Subject” to the name variable from Shortcut Input, handy for reviewing unrecognized emails.
zh_hans: (可选)把「邮件主题」设为「快捷指令输入」里的名称变量,便于未识别时回看。

# (可选)若你的卡是外币,可在「币种」填 3 位币码;留空则按本位币处理。
source: (Optional) If your card is in a foreign currency, enter a 3-letter code in Currency; leave it blank to use your base currency.
zh_hans: (可选)若你的卡是外币,可在「币种」填 3 位币码;留空则按本位币处理。

# （汇率待补）
source: (rate pending)
zh_hans: （汇率待补）

# (若出现)选「创建个人自动化 / Create Personal Automation」。
source: (If shown) choose “Create Personal Automation”.
zh_hans: (若出现)选「创建个人自动化 / Create Personal Automation」。

# %@ · 汇率待补
source: %@ · rate pending
zh_hans: %@ · 汇率待补

# %lld 笔待确认
source: %lld pending
zh_hans: %lld 笔待确认

# ✓ 已生成 %lld 笔待确认(到流水页确认),app 侧 OK。
source: ✓ Created %lld pending transaction(s) (confirm them on the ledger page). The app side is OK.
zh_hans: ✓ 已生成 %lld 笔待确认(到流水页确认),app 侧 OK。

# ✓ 测试短信已收到并落盘(到流水页查看)。建好你自己的短信模版后,真实账单短信会自动识别金额、商户。
source: ✓ Test SMS received and saved (see the transactions list). Once you build your own SMS template, real bill SMS will auto-detect the amount and merchant.
zh_hans: ✓ 测试短信已收到并落盘(到流水页查看)。建好你自己的短信模版后,真实账单短信会自动识别金额、商户。

# ✓ 这条模版能认出示例：金额 %@／币种 %@／商户 %@
source: ✓ This template recognizes the sample: amount %@ / currency %@ / merchant %@
zh_hans: ✓ 这条模版能认出示例：金额 %@／币种 %@／商户 %@

# ✓ 这条模版能认出示例：金额 %@／币种 %@／商户 %@／日期 %@
source: ✓ This template recognizes the sample: amount %@ / currency %@ / merchant %@ / date %@
zh_hans: ✓ 这条模版能认出示例：金额 %@／币种 %@／商户 %@／日期 %@

# ① 在 app 内测试
source: ① Test inside the app
zh_hans: ① 在 app 内测试

# ① 在 app 内测试解析+落盘
source: 1) Test parsing + saving in-app
zh_hans: ① 在 app 内测试解析+落盘

# ② 端到端测试:给自己发一条含关键词的短信(或等下一条真实银行短信),约 1 分钟后回到 app 流水页,应该能看到一笔新的待确认草稿。
source: 2) End-to-end test: text yourself a message containing the keyword (or wait for your next real bank SMS). Come back to the app's ledger page in about a minute and you should see a new pending draft.
zh_hans: ② 端到端测试:给自己发一条含关键词的短信(或等下一条真实银行短信),约 1 分钟后回到 app 流水页,应该能看到一笔新的待确认草稿。

# ② 给自己发一条含关键词的短信,约 1 分钟后到流水页看待确认草稿。
source: ② Text yourself an SMS containing the keyword; after about a minute, check the ledger for a pending draft.
zh_hans: ② 给自己发一条含关键词的短信,约 1 分钟后到流水页看待确认草稿。

source: Add Transaction
zh_hans: 记一笔交易

# Apple Pay 自动记账
source: Apple Pay auto-tracking
zh_hans: Apple Pay 自动记账

# Apple Pay 自动记账已就绪,下次线下刷卡即自动入账。
source: Apple Pay auto-recording is ready — your next in-store tap will be recorded automatically.
zh_hans: Apple Pay 自动记账已就绪,下次线下刷卡即自动入账。

# Apple Pay 自动记账已就绪。下次线下刷卡即自动入账,无需任何操作。
source: Apple Pay auto-tracking is ready. Your next in-person payment is recorded automatically — nothing to do.
zh_hans: Apple Pay 自动记账已就绪。下次线下刷卡即自动入账,无需任何操作。

# app订阅
source: Subscriptions
zh_hans: app订阅

# 5分钱 的「处理银行短信」动作装好 app 就已经在「快捷指令」里了,不用导入任何东西。跟着下面做一个快捷指令:
source: 5 cents's "Ingest bank SMS" action is already in the Shortcuts app once the app is installed — nothing to import. Follow these steps to build a shortcut:
zh_hans: 5分钱 的「处理银行短信」动作装好 app 就已经在「快捷指令」里了,不用导入任何东西。跟着下面做一个快捷指令:

# 一切就绪
source: All set
zh_hans: 一切就绪

# 上一步
source: Back
zh_hans: 上一步

# 上月
source: Last Month
zh_hans: 上月

# 下一步
source: Next
zh_hans: 下一步

# 下次：%@
source: Next: %@
zh_hans: 下次：%@

# 下次日期
source: Next Date
zh_hans: 下次日期

# 不知道发件地址?去邮箱里翻一封该银行的交易邮件,看「发件人」一栏照填即可。
source: Don’t know the sender address? Open one of the bank’s transaction emails in Mail and copy what’s in the “From” field.
zh_hans: 不知道发件地址?去邮箱里翻一封该银行的交易邮件,看「发件人」一栏照填即可。

# 不选
source: None
zh_hans: 不选

# 为什么不能替你建:『信息』自动化能在锁屏、你不在场时读到整条短信,iOS 出于隐私保护,规定这一步只能你亲手在「快捷指令」app 里建。
source: Why we can't create it for you: a Messages automation can read your full message even on the lock screen while you're away. For privacy, iOS requires that you create this step yourself in the Shortcuts app.
zh_hans: 为什么不能替你建:『信息』自动化能在锁屏、你不在场时读到整条短信,iOS 出于隐私保护,规定这一步只能你亲手在「快捷指令」app 里建。

# 为什么要你亲手建:iOS 出于隐私,自动化只能你自己在「快捷指令」app 里建,任何 app 都无法替你创建。
source: Why you build it yourself: for privacy, iOS only lets you create automations yourself in the Shortcuts app — no app can create one for you.
zh_hans: 为什么要你亲手建:iOS 出于隐私,自动化只能你自己在「快捷指令」app 里建,任何 app 都无法替你创建。

# 为什么要你亲手建:iOS 出于隐私,自动化只能你自己在「快捷指令」里建,app 无法替你创建,也从不读取你的邮箱。
source: Why you build it yourself: for privacy, iOS only lets you create automations in the Shortcuts app; no app can create them for you, and 5 cents never reads your mailbox.
zh_hans: 为什么要你亲手建:iOS 出于隐私,自动化只能你自己在「快捷指令」里建,app 无法替你创建,也从不读取你的邮箱。

# 交易邮件
source: Transaction email
zh_hans: 交易邮件

# 交通
source: Transport
zh_hans: 交通

# 今年
source: This Year
zh_hans: 今年

# 从剪贴板粘贴
source: Paste from Clipboard
zh_hans: 从剪贴板粘贴

# 从文件还原…
source: Restore from File…
zh_hans: 从文件还原…

# 住房
source: Housing
zh_hans: 住房

# 你常收哪种交易通知？
source: Which transaction alerts do you usually get?
zh_hans: 你常收哪种交易通知？

# 保存
source: Save
zh_hans: 保存

# 保存模版
source: Save Template
zh_hans: 保存模版

# 做好后,你的「我的快捷指令」里会有一个名叫「记账短信」、已接好「短信全文 ← 快捷指令输入」的指令。下一步把它挂到收到短信时自动跑。
source: When done, "My Shortcuts" will have one named "SMS Logging" with "message ← Shortcut Input" wired up. Next, hook it up to run automatically when a message arrives.
zh_hans: 做好后,你的「我的快捷指令」里会有一个名叫「记账短信」、已接好「短信全文 ← 快捷指令输入」的指令。下一步把它挂到收到短信时自动跑。

# 先决条件:先到「识别模版 ▸ 邮件模版」建一个邮件模版。
source: Prerequisite: first create an email template under Templates ▸ Email Templates.
zh_hans: 先决条件:先到「识别模版 ▸ 邮件模版」建一个邮件模版。

# 先决条件:需要先在「识别模版 ▸ 邮件模版」里粘一封你银行的交易邮件,标注金额/商户,建一个邮件模版。运行时按它来认。
source: Prerequisite: first build an email template under Recognition Templates ▸ Email Template by pasting one of your bank’s transaction emails and tagging the amount/merchant. Recognition uses it at runtime.
zh_hans: 先决条件:需要先在「识别模版 ▸ 邮件模版」里粘一封你银行的交易邮件,标注金额/商户,建一个邮件模版。运行时按它来认。

# 先在 app 内跑一遍,确认 app 这边能正常解析、落盘;再给自己发一条真实短信,验证自动化通不通。
source: First run it in-app to confirm the app can parse and save correctly; then text yourself a real message to check the automation end-to-end.
zh_hans: 先在 app 内跑一遍,确认 app 这边能正常解析、落盘;再给自己发一条真实短信,验证自动化通不通。

# 先选下面的类别，再点上面的词，词会高亮成该类别的颜色；连点相邻的词可连成一段。
source: Pick a category below, then tap the words above — each word highlights in that category's color; tap adjacent words to join them into one segment.
zh_hans: 先选下面的类别，再点上面的词，词会高亮成该类别的颜色；连点相邻的词可连成一段。

# 全部
source: All
zh_hans: 全部

# 关于
source: About
zh_hans: 关于

# 关掉「运行时通知 / Notify When Run」,点「下一步 / Next」。
source: Turn off “Notify When Run”, then tap “Next”.
zh_hans: 关掉「运行时通知 / Notify When Run」,点「下一步 / Next」。

# 关掉「运行时通知 / Notify When Run」,这样每笔自动记账不会打扰你。
source: Turn off Notify When Run so each auto-recorded transaction doesn't interrupt you.
zh_hans: 关掉「运行时通知 / Notify When Run」,这样每笔自动记账不会打扰你。

# 关闭 App
source: Close App
zh_hans: 关闭 App

# 其他
source: Other
zh_hans: 其他

# 其他收入
source: Other Income
zh_hans: 其他收入

# 再加一个操作:搜索并选「处理银行邮件」(5分钱 提供,装好 app 即在列表里)。
source: Add another action: search for and choose “Ingest bank email” (provided by 5 cents; it appears once the app is installed).
zh_hans: 再加一个操作:搜索并选「处理银行邮件」(5分钱 提供,装好 app 即在列表里)。

# 再加操作「处理银行邮件」。
source: Add another action: “Process bank email”.
zh_hans: 再加操作「处理银行邮件」。

# 再提醒一次:以后每来一条记账短信,会自动记一笔草稿 + 一条系统通知,到 app 流水页确认即可,属正常。
source: One more reminder: from now on, each transaction SMS auto-logs a draft plus a system notification. Just confirm it on the app's ledger page — that's normal.
zh_hans: 再提醒一次:以后每来一条记账短信,会自动记一笔草稿 + 一条系统通知,到 app 流水页确认即可,属正常。

# 最后一步:建一个自动短信触发
source: Last step: set up an automatic SMS trigger
zh_hans: 最后一步:建一个自动短信触发

# 最后一步要你手动建一个『信息』自动化(iOS 规定只能你亲手建),共约 6 小步,我一步步带你,关键词已帮你复制好。每次自动记账会有一条系统通知,属正常。
source: The last step asks you to manually create a Messages automation (iOS requires you to create it yourself). It's about 6 small steps — I'll walk you through each one, and the keyword is already copied for you. Each auto-logged transaction will show a system notification; that's normal.
zh_hans: 最后一步要你手动建一个『信息』自动化(iOS 规定只能你亲手建),共约 6 小步,我一步步带你,关键词已帮你复制好。每次自动记账会有一条系统通知,属正常。

# 准备
source: Prepare
zh_hans: 准备

# 分类
source: Category
zh_hans: 分类

# 分类（不选 = 未分类）
source: Category (none = Uncategorized)
zh_hans: 分类（不选 = 未分类）

# 分类占比
source: By Category
zh_hans: 分类占比

# 分类排行
source: Category Ranking
zh_hans: 分类排行

# 分类管理
source: Manage Categories
zh_hans: 分类管理

# 切换语言后需重启 App 才会生效。
source: Changing the language takes effect after you restart the app.
zh_hans: 切换语言后需重启 App 才会生效。

# 删除
source: Delete
zh_hans: 删除

# 删除分类「%@」？该分类下暂无交易。
source: Delete category “%@”? It has no transactions.
zh_hans: 删除分类「%@」？该分类下暂无交易。

# 删除此周期规则不会删除已生成的交易。
source: Deleting this recurring rule will not delete transactions already generated.
zh_hans: 删除此周期规则不会删除已生成的交易。

# 加操作「从输入获取文本 / Get Text from Input」。
source: Add the action “Get Text from Input”.
zh_hans: 加操作「从输入获取文本 / Get Text from Input」。

# 勾选后我们带你逐个配好自动记账；没有也能手动记账。
source: Pick any and we’ll set up auto-logging one by one; you can always log manually too.
zh_hans: 勾选后我们带你逐个配好自动记账；没有也能手动记账。

# 勾选要追踪的卡(建议常用卡全选)。
source: Check the cards to track (selecting all your everyday cards is recommended).
zh_hans: 勾选要追踪的卡(建议常用卡全选)。

# 医疗
source: Medical
zh_hans: 医疗

# 卡号
source: Card no.
zh_hans: 卡号

# 卡尾号通配（多卡也能匹配）
source: Wildcard card digits (match all cards)
zh_hans: 卡尾号通配（多卡也能匹配）

# 原文
source: Original Text
zh_hans: 原文

# 发送测试
source: Send Test
zh_hans: 发送测试

# 取消
source: Cancel
zh_hans: 取消

# 可以把银行消费短信自动记成一笔待确认账目。设置稍后再配置也可以。
source: Bank transaction texts can be turned into pending entries automatically. You can set this up later.
zh_hans: 可以把银行消费短信自动记成一笔待确认账目。设置稍后再配置也可以。

# 可能与已记的 Apple Pay 交易重复(同金额、同币种、时间相近)。若确属同一笔请拒绝。
source: Possibly a duplicate of an Apple Pay transaction already recorded (same amount, currency, and a nearby time). If it's the same purchase, reject it.
zh_hans: 可能与已记的 Apple Pay 交易重复(同金额、同币种、时间相近)。若确属同一笔请拒绝。

# 可能与已记的另一笔交易重复(同金额、同币种、时间相近)。若确属同一笔请拒绝。
source: May duplicate another recorded transaction (same amount, same currency, close in time). If it’s the same one, reject it.
zh_hans: 可能与已记的另一笔交易重复(同金额、同币种、时间相近)。若确属同一笔请拒绝。

# 名称
source: Name
zh_hans: 名称

# 启用
source: Enabled
zh_hans: 启用

# 周期
source: Period
zh_hans: 周期

# 周期交易
source: Recurring
zh_hans: 周期交易

# 命名「记账短信」并保存。
source: Name it “Bookkeeping SMS” and save.
zh_hans: 命名「记账短信」并保存。

# 和短信最大的不同:邮件按「发件人(银行邮箱域名)」过滤,不是正文关键词。银行发件地址固定,反而比短信关键词更稳更准。
source: The biggest difference from SMS: email filters by Sender (the bank’s email domain), not body keywords. A bank’s sending address is fixed, so it’s actually more reliable than SMS keywords.
zh_hans: 和短信最大的不同:邮件按「发件人(银行邮箱域名)」过滤,不是正文关键词。银行发件地址固定,反而比短信关键词更稳更准。

# 咖啡
source: Coffee
zh_hans: 咖啡

# 商户
source: Merchant
zh_hans: 商户

# 商户名
source: Merchant
zh_hans: 商户名

# 图标（单个 emoji）
source: Icon (single emoji)
zh_hans: 图标（单个 emoji）

source: Under "Message Contains", tap "Choose" and long-press to paste (the keyword is already copied). You can leave Sender empty. Then tap "Next".
zh_hans: 在「信息包含 / Message Contains」里点「选取 / Choose」,长按粘贴(关键词已复制好)。发件人 Sender 可留空。然后点「下一步 / Next」。

# 在「信息包含 / Message Contains」里长按粘贴关键词,点「下一步 / Next」。
source: In “Message Contains”, long-press to paste the keyword, then tap “Next”.
zh_hans: 在「信息包含 / Message Contains」里长按粘贴关键词,点「下一步 / Next」。

# 在「发件人 / Sender」填银行交易邮件的发件地址(如 alerts@uob.com.sg)。
source: In “Sender”, enter the from-address of your bank's transaction emails (e.g. alerts@uob.com.sg).
zh_hans: 在「发件人 / Sender」填银行交易邮件的发件地址(如 alerts@uob.com.sg)。

# 在「发件人 / Sender」里填你银行交易邮件的发件地址(如 alerts@uob.com.sg)。只认这个发件人来的邮件,最准。
source: In “Sender”, enter the address your bank’s transaction emails come from (e.g. alerts@uob.com.sg). Matching only that sender is the most accurate.
zh_hans: 在「发件人 / Sender」里填你银行交易邮件的发件地址(如 alerts@uob.com.sg)。只认这个发件人来的邮件,最准。

# 在「快捷指令」底部找到并点「自动化 / Automation」。
source: At the bottom of Shortcuts, find and tap "Automation".
zh_hans: 在「快捷指令」底部找到并点「自动化 / Automation」。

# 在列表里找到并点「交易 / Transaction」(iOS 26 上叫「钱包 / Wallet」)。
source: Find and tap Transaction in the list (called Wallet on iOS 26).
zh_hans: 在列表里找到并点「交易 / Transaction」(iOS 26 上叫「钱包 / Wallet」)。

# 在列表里找到并点「邮件 / Email」。
source: Find and tap “Email” in the list.
zh_hans: 在列表里找到并点「邮件 / Email」。

# 在原文里找不到「%@」，将不识别日期、改用短信到达时刻。
source: Can't find “%@” in the original text — the date won't be recognized; the time the SMS arrived will be used instead.
zh_hans: 在原文里找不到「%@」，将不识别日期、改用短信到达时刻。

# 在原文里找不到「%@」，请用原文里的写法。
source: Can't find “%@” in the original text — please use the spelling exactly as it appears.
zh_hans: 在原文里找不到「%@」，请用原文里的写法。

# 在原文里找不到「%@」的写法，将改用下面的「币种回退」。
source: Couldn't find “%@” in the text; the fallback currency below will be used.
zh_hans: 在原文里找不到「%@」的写法，将改用下面的「币种回退」。

# 在底部点「快捷指令 / Shortcuts」,右上角点「+」新建一个。
source: Tap "Shortcuts" at the bottom, then tap "+" in the top right to create a new one.
zh_hans: 在底部点「快捷指令 / Shortcuts」,右上角点「+」新建一个。

# 在底部点「自动化 / Automation」标签。
source: Tap the Automation tab at the bottom.
zh_hans: 在底部点「自动化 / Automation」标签。

# 在触发列表里找到并点「信息 / Message」。
source: In the trigger list, find and tap "Message".
zh_hans: 在触发列表里找到并点「信息 / Message」。

# 在触发列表里点「信息 / Message」。
source: In the trigger list, tap “Message”.
zh_hans: 在触发列表里点「信息 / Message」。

# 在触发列表里点「邮件 / Email」。
source: In the trigger list, tap “Email”.
zh_hans: 在触发列表里点「邮件 / Email」。

# 在触发列表里选「钱包 / Wallet」。
source: In the trigger list, pick "Wallet".
zh_hans: 在触发列表里选「钱包 / Wallet」。

# 在触发类型列表里,选「邮件 / Email」。它和「信息 / Message」同属「通讯」分组。
source: In the trigger list, choose “Email”. It’s in the “Communication” group alongside “Message”.
zh_hans: 在触发类型列表里,选「邮件 / Email」。它和「信息 / Message」同属「通讯」分组。

# 在触发类型列表里,选与 Apple Pay 交易相关的那一项。不同 iOS 版本名字略有差异。
source: In the list of trigger types, choose the one for Apple Pay transactions. The name varies slightly by iOS version.
zh_hans: 在触发类型列表里,选与 Apple Pay 交易相关的那一项。不同 iOS 版本名字略有差异。

# 填发件人
source: Sender
zh_hans: 填发件人

# 处理银行短信
source: Ingest bank SMS
zh_hans: 处理银行短信

# 备注
source: Note
zh_hans: 备注

# 好
source: OK
zh_hans: 好

# 学习
source: Education
zh_hans: 学习

# 完成
source: Done
zh_hans: 完成

# 工资
source: Salary
zh_hans: 工资

# 已复制
source: Copied
zh_hans: 已复制

# 已收到，待在 app 内识别。
source: Received — will be recognized in the app.
zh_hans: 已收到，待在 app 内识别。

# 已收到待确认：%@ %@
source: Received (pending): %@ %@
zh_hans: 已收到待确认：%@ %@

# 已收到待确认：%@ %@ %@
source: Received (pending): %@ %@ %@
zh_hans: 已收到待确认：%@ %@ %@

# 已自动记录:(amtDisplay)
source: Auto-recorded: \(amtDisplay)
zh_hans: 已自动记录:\(amtDisplay)

# 已自动记录:(amtDisplay) (md)
source: Auto-recorded: \(amtDisplay) \(md)
zh_hans: 已自动记录:\(amtDisplay) \(md)

# 已记录：%@
source: Recorded: %@
zh_hans: 已记录：%@

# 币种
source: Currency
zh_hans: 币种

# 币种回退
source: Currency Fallback
zh_hans: 币种回退

# 常用
source: Common
zh_hans: 常用

# 应用语言会自动跟随你的系统语言。
source: The app language follows your system language automatically.
zh_hans: 应用语言会自动跟随你的系统语言。

# 底部点「自动化 / Automation」,再点右上角「+」。
source: Tap “Automation” at the bottom, then tap “+” in the top-right.
zh_hans: 底部点「自动化 / Automation」,再点右上角「+」。

# 建好后,下次来一封该银行的交易邮件,约几秒到几分钟内 app 待确认收件箱就会出现这一笔。
source: Once set up, the next transaction email from that bank will appear in the app’s pending inbox within seconds to minutes.
zh_hans: 建好后,下次来一封该银行的交易邮件,约几秒到几分钟内 app 待确认收件箱就会出现这一笔。

# 建好后,下次用选中的卡线下刷 Apple Pay,约几秒内 app 流水里就会自动出现这一笔。
source: Once set up, the next time you tap to pay in person with a selected card, the transaction appears in the app's ledger automatically within seconds.
zh_hans: 建好后,下次用选中的卡线下刷 Apple Pay,约几秒内 app 流水里就会自动出现这一笔。

# 建自动化
source: Automation
zh_hans: 建自动化

# 开始
source: Start
zh_hans: 开始

# 开始使用
source: Get Started
zh_hans: 开始使用

# 待确认收件箱
source: Pending Inbox
zh_hans: 待确认收件箱

# 快捷指令
source: Shortcut
zh_hans: 快捷指令

# 我们要在「快捷指令」app 里新建一个自动化。点下面的按钮打开它,然后到底部的「自动化」标签。
source: We'll create a new automation in the Shortcuts app. Tap the button below to open it, then go to the Automation tab at the bottom.
zh_hans: 我们要在「快捷指令」app 里新建一个自动化。点下面的按钮打开它,然后到底部的「自动化」标签。

# 我的银行
source: My Bank
zh_hans: 我的银行

# 手动补一笔
source: Add manually
zh_hans: 手动补一笔

# 打开「快捷指令」
source: Open Shortcuts
zh_hans: 打开「快捷指令」

# 打开「快捷指令」app
source: Open the Shortcuts app
zh_hans: 打开「快捷指令」app

# 打开「快捷指令」自动化
source: Open Shortcuts Automation
zh_hans: 打开「快捷指令」自动化

# 找不到?在列表里下滑到「通讯 / Communication」分组,「邮件 / Email」就在「信息 / Message」附近。
source: Can’t find it? Scroll to the “Communication” group; “Email” is near “Message”.
zh_hans: 找不到?在列表里下滑到「通讯 / Communication」分组,「邮件 / Email」就在「信息 / Message」附近。

# 找不到?在该列表里下滑,它通常在靠后的位置;可用搜索框输入「交易 / Transaction / 钱包 / Wallet」。
source: Can't find it? Scroll down — it's usually near the bottom; or search for Transaction / Wallet.
zh_hans: 找不到?在该列表里下滑,它通常在靠后的位置;可用搜索框输入「交易 / Transaction / 钱包 / Wallet」。

# 把「处理银行邮件」的「邮件正文」参数,设为上一步「获取文本」的输出(点参数 → 选「文本」变量)。
source: Set the “Email Body” parameter of “Ingest bank email” to the output of the “Get Text” step (tap the parameter → choose the “Text” variable).
zh_hans: 把「处理银行邮件」的「邮件正文」参数,设为上一步「获取文本」的输出(点参数 → 选「文本」变量)。

# 把「处理银行邮件」的「邮件正文」设为上一步「文本」的输出。
source: Set the “Email body” of “Process bank email” to the “Text” output from the previous step.
zh_hans: 把「处理银行邮件」的「邮件正文」设为上一步「文本」的输出。

# 把「钱包」交易 (amount) (merchant) 记入流水
source: Record Wallet transaction \(amount) \(merchant)
zh_hans: 把「钱包」交易 \(amount) \(merchant) 记入流水

# 把一条交易短信全文喂给 5分钱，静默按你的短信模版识别并落盘成一笔待确认草稿（无匹配模版则落原文待识别，绝不丢弃）。
source: Feed one full transaction SMS to 5 cents; it silently matches your SMS templates and saves a pending draft (if no template matches, the original text is saved for in-app recognition — nothing is ever dropped).
zh_hans: 把一条交易短信全文喂给 5分钱，静默按你的短信模版识别并落盘成一笔待确认草稿（无匹配模版则落原文待识别，绝不丢弃）。

# 把一笔「钱包」交易(商户+金额)直接记入 5分钱 流水,全自动、无需确认。外币自动换算成本位币。
source: Record a Wallet transaction (merchant + amount) straight into 5 cents — fully automatic, no confirmation. Foreign amounts are auto-converted to your base currency.
zh_hans: 把一笔「钱包」交易(商户+金额)直接记入 5分钱 流水,全自动、无需确认。外币自动换算成本位币。

# 把你银行的一封交易邮件粘贴进来（整封即可，含 HTML 也行），我们会自动抽出含金额的关键段来认一认。
source: Paste one of your bank’s transaction emails (the whole thing is fine, HTML included); we’ll automatically extract the key part with the amount.
zh_hans: 把你银行的一封交易邮件粘贴进来（整封即可，含 HTML 也行），我们会自动抽出含金额的关键段来认一认。

# 把你银行的一条交易短信粘贴进来，我们来认一认。
source: Paste one transaction SMS from your bank and we'll detect the fields.
zh_hans: 把你银行的一条交易短信粘贴进来，我们来认一认。

# 把动作的「金额」参数设为触发提供的「金额 / Amount」,「商户」参数设为「商户 / Merchant」(点参数 → 从「快捷指令输入」里选对应变量)。
source: Set the action's Amount parameter to the trigger's Amount, and its Merchant parameter to Merchant (tap the parameter → pick the matching variable from Shortcut Input).
zh_hans: 把动作的「金额」参数设为触发提供的「金额 / Amount」,「商户」参数设为「商户 / Merchant」(点参数 → 从「快捷指令输入」里选对应变量)。

# 把动作输入设为「快捷指令输入 / Shortcut Input」。
source: Set the action's input to “Shortcut Input”.
zh_hans: 把动作输入设为「快捷指令输入 / Shortcut Input」。

# 把短信 %@ 落盘成待确认草稿
source: Save message %@ as a pending draft
zh_hans: 把短信 %@ 落盘成待确认草稿

# 把运行方式设为「立即运行 / Run Immediately」,这样无需每封手动确认。
source: Set it to “Run Immediately” so you don’t have to confirm each email manually.
zh_hans: 把运行方式设为「立即运行 / Run Immediately」,这样无需每封手动确认。

# 把运行方式设为「立即运行 / Run Immediately」。
source: Set it to Run Immediately.
zh_hans: 把运行方式设为「立即运行 / Run Immediately」。

source: Set it to "Run Immediately" (if you see "Ask Before Running", turn it off), then tap "Done".
zh_hans: 把运行方式设成「立即运行 / Run Immediately」(若看到「运行前询问 / Ask Before Running」就关掉它),点「完成 / Done」。

# 把这个动作的输入设为「快捷指令输入 / Shortcut Input」(点动作里的「短信全文」参数 → 选「快捷指令输入」)。
source: Set the action's input to "Shortcut Input" (tap the action's "message" parameter, then choose "Shortcut Input").
zh_hans: 把这个动作的输入设为「快捷指令输入 / Shortcut Input」(点动作里的「短信全文」参数 → 选「快捷指令输入」)。

# 拒绝
source: Reject
zh_hans: 拒绝

# 按分类筛选
source: Filter by Category
zh_hans: 按分类筛选

# 换个时间范围或先记几笔。
source: Pick another range or add a few records first.
zh_hans: 换个时间范围或先记几笔。

# 接动作
source: Action
zh_hans: 接动作

# 接受
source: Accept
zh_hans: 接受

# 接受这一笔
source: Accept This One
zh_hans: 接受这一笔

# 提示:选了「立即运行」后,每来一封记账邮件 iOS 会发一条系统通知(邮件触发无法关掉,属正常)。
source: Note: with “Run Immediately”, iOS posts a system notification for each email (this can’t be turned off for email triggers — that’s normal).
zh_hans: 提示:选了「立即运行」后,每来一封记账邮件 iOS 会发一条系统通知(邮件触发无法关掉,属正常)。

# 搜索币种
source: Search currency
zh_hans: 搜索币种

source: The action shows "Amount" and "Merchant" as blue fillable fields. Tap "Amount" and pick the trigger’s "Amount"; tap "Merchant" and pick "Merchant". You must connect "Amount", or nothing gets recorded.
zh_hans: 操作会显示成一句:「把「钱包」交易 [金额] [商户] 记入流水」。点蓝色的「金额」,选触发器的「金额 / Amount」;点「商户」,选「商户 / Merchant」。「金额」必须接上,否则记的是空账。

# 支出
source: Expense
zh_hans: 支出

# 支出 %@
source: Expense %@
zh_hans: 支出 %@

# 支出趋势
source: Spending Trend
zh_hans: 支出趋势

# 收入
source: Income
zh_hans: 收入

# 收入 %@
source: Income %@
zh_hans: 收入 %@

# 收到银行交易短信后自动记一笔。
source: Auto-log a transaction when you get a bank transaction SMS.
zh_hans: 收到银行交易短信后自动记一笔。

# 收到银行交易邮件后自动记一笔。
source: Auto-log a transaction when you get a bank transaction email.
zh_hans: 收到银行交易邮件后自动记一笔。

# 收支类型
source: Type
zh_hans: 收支类型

# 教学视频(即将上线)
source: Tutorial video (coming soon)
zh_hans: 教学视频(即将上线)

# 数据备份与还原
source: Data Backup & Restore
zh_hans: 数据备份与还原

# 数据已就绪。App 即将关闭，请重新打开以完成还原。
source: Data is ready. The app will now close — reopen it to finish restoring.
zh_hans: 数据已就绪。App 即将关闭，请重新打开以完成还原。

# 新增分类
source: Add Category
zh_hans: 新增分类

# 新增周期交易
source: Add Recurring
zh_hans: 新增周期交易

# 新建
source: New
zh_hans: 新建

# 新建快捷指令
source: New Shortcut
zh_hans: 新建快捷指令

# 新建模版
source: New Template
zh_hans: 新建模版

# 新建短信模版
source: New SMS Template
zh_hans: 新建短信模版

# 新建邮件模版
source: New Email Template
zh_hans: 新建邮件模版

# 旅行
source: Travel
zh_hans: 旅行

# 无法保存
source: Can't Save
zh_hans: 无法保存

# 无法解析，将用短信到达时刻
source: Can't parse — will use the time the SMS arrived
zh_hans: 无法解析，将用短信到达时刻

# 无法解析金额
source: Can't parse amount
zh_hans: 无法解析金额

# 无法读取该备份文件（可能不是有效的 %@）：%@
source: Cannot read this backup file (it may not be a valid %@): %@
zh_hans: 无法读取该备份文件（可能不是有效的 %@）：%@

# 日期
source: Date
zh_hans: 日期

# 暂无分类
source: No categories
zh_hans: 暂无分类

# 暂无周期交易。点右上角 + 新增。
source: No recurring transactions. Tap + at the top right to add one.
zh_hans: 暂无周期交易。点右上角 + 新增。

# 更改失败
source: Change Failed
zh_hans: 更改失败

# 更改本位币会按当前汇率重算所有历史交易的本位金额，与当初记账汇率不同。已自动备份。继续？
source: Changing the base currency recomputes the base amount of every past transaction at the current exchange rate, which differs from the rate recorded at entry time. A backup has been made automatically. Continue?
zh_hans: 更改本位币会按当前汇率重算所有历史交易的本位金额，与当初记账汇率不同。已自动备份。继续？

# 有些银行/平台只发交易邮件,不发短信。配一次「邮件」自动化,以后每来一封交易邮件都会自动识别成一笔待确认。下面带你建这唯一一次自动化。
source: Some banks/platforms only send transaction emails, not SMS. Set up an “Email” automation once, and every transaction email after that is automatically turned into a draft for confirmation. We’ll walk you through this one-time setup.
zh_hans: 有些银行/平台只发交易邮件,不发短信。配一次「邮件」自动化,以后每来一封交易邮件都会自动识别成一笔待确认。下面带你建这唯一一次自动化。

# 未分类
source: Uncategorized
zh_hans: 未分类

# 未知商户
source: Unknown merchant
zh_hans: 未知商户

# 未能识别金额,这一笔未记录。
source: Couldn't read the amount — this transaction wasn't recorded.
zh_hans: 未能识别金额,这一笔未记录。

# 未识别短信
source: Unrecognized SMS
zh_hans: 未识别短信

# 本位币
source: Base Currency
zh_hans: 本位币

# 本位币是统计和汇总时使用的货币。记账时可以用任意货币，应用会按汇率折算到本位币。
source: Your base currency is used for totals and statistics. You can record entries in any currency, and they will be converted to your base currency.
zh_hans: 本位币是统计和汇总时使用的货币。记账时可以用任意货币，应用会按汇率折算到本位币。

# 本月
source: This Month
zh_hans: 本月

# 本月暂无记录
source: No records this month
zh_hans: 本月暂无记录

# 模版名
source: Template Name
zh_hans: 模版名

# 模版已保存
source: Template Saved
zh_hans: 模版已保存
